import { Dispatch, SetStateAction, useEffect } from "react";
import styles from "./PolicyModal.module.scss";
import className from "classnames/bind";

const cx = className.bind(styles);

type Props = {
  visible: boolean;
  partName: "service" | "personal";
  setVisible: Dispatch<SetStateAction<boolean>>;
};

export default function PolicyModal({ visible, partName, setVisible }: Props) {
  const servisePolicy = (
    <div className={cx("terms_body")}>
      <span className={cx("title")}>제 1조 목적</span>본 이용약관은
      &#34;방배사&#34;(이하 &#34;사이트&#34;)의 서비스의 이용조건과 운영에 관한
      제반 사항 규정을 목적으로 합니다.
      <span className={cx("title")}>제 2조 용어의 정의</span>
      본 약관에서 사용되는 주요한 용어의 정의는 다음과 같습니다. <br />
      1) 이용자 : 사이트에 방문하여 사이트를 이용하는 이용자를 말합니다. <br />
      2) 운영자 : 서비스에 홈페이지를 개설하여 운영하는 운영자를 말합니다.
      <span className={cx("title")}>제 3조 약관 외 준칙</span>
      운영자는 필요한 경우 별도로 운영정책을 공지 안내할 수 있으며, 본 약관과
      운영정책이 중첩될 경우 운영정책이 우선 적용됩니다. <br />
      <span className={cx("title")}>제 4조 서비스 이용 신청</span>
      1) 사이트를 이용하려는 이용자는 사이트에서 요청하는 제반 정보(회신 받으실
      이메일, 연락처, 문의내용을)을 제출할 수 있습니다. <br />
      2) 타인의 정보를 도용하거나 허위의 정보를 제출하는 등 본인의 진정한 정보를
      제출하지 않은 이용자는 사이트 이용과 관련하여 아무런 권리를 주장할 수
      없으며, 관계 법령에 따라 처벌받을 수 있습니다. <br />
      <span className={cx("title")}>제 5조 운영자의 의무</span>
      1) 운영자는 이용자로부터 제기되는 의견이나 불만이 정당하다고 인정할
      경우에는 가급적 빨리 처리하여야 합니다. 다만, 개인적인 사정으로 신속한
      처리가 곤란한 경우에는 사후에 공지 또는 이용회원에게 쪽지, 전자우편 등을
      보내는 등 최선을 다합니다. <br />
      2) 운영자는 계속적이고 안정적인 사이트 제공을 위하여 설비에 장애가
      생기거나 유실된 때에는 이를 지체 없이 수리 또는 복구할 수 있도록 사이트에
      요구할 수 있습니다. 다만, 천재지변 또는 사이트나 운영자에 부득이한 사유가
      있는 경우, 사이트 운영을 일시 정지할 수 있습니다. <br />
      <span className={cx("title")}>제 6조 이용자의 의무</span>
      1) 이용자는 본 약관에서 규정하는 사항과 운영자가 정한 제반 규정, 운영정책
      등 사이트가 공지하는 사항 및 관계 법령을 준수하여야 하며, 기타 사이트의
      업무에 방해가 되는 행위, 사이트의 명예를 손상하는 행위를 해서는 안 됩니다.{" "}
      <br />
      2) 이용자는 사이트의 명시적 동의가 없는 한 서비스의 이용 권한, 기타
      이용계약상 지위를 타인에게 양도, 증여할 수 없으며, 이를 담보로 제공할 수
      없습니다. <br />
      3) 이용자는 운영자와 사이트 및 제3자의 지적 재산권을 침해해서는 안 됩니다.{" "}
      <span className={cx("title")}>제 7조 서비스 이용 시간</span>
      1) 서비스 이용 시간은 업무상 또는 기술상 특별한 지장이 없는 한 연중무휴
      1일 24시간을 원칙으로 합니다. 단, 사이트는 시스템 정기점검, 증설 및 교체를
      위해 사이트가 정한 날이나 시간에 서비스를 일시 중단 할 수 있으며 예정된
      작업으로 인한 서비스 일시 중단은 사이트의 홈페이지에 사전에 공지하오니
      수시로 참고하시길 바랍니다. <br />
      2) 단, 사이트는 다음 경우에 대하여 사전 공지나 예고 없이 서비스를 일시적
      혹은 영구적으로 중단할 수 있습니다. - 긴급한 시스템 점검, 증설, 교체, 고장
      혹은 오동작을 일으키는 경우 - 국가비상사태, 정전, 천재지변 등의
      불가항력적인 사유가 있는 경우 - 전기통신사업법에 규정된 기간통신사업자가
      전기통신 서비스를 중지한 경우 - 서비스 이용의 폭주 등으로 정상적인 서비스
      이용에 지장이 있는 경우 <br />
      3) 전항에 의한 서비스 중단의 경우 사이트는 사전에 공지사항 등을 통하여
      회원에게 통지합니다. 단, 사이트가 통제할 수 없는 사유로 발생한 서비스의
      중단에 대하여 사전 공지가 불가능한 경우에는 사후 공지로 대신합니다.
      <span className={cx("title")}>제 8조 서비스 이용 제한</span>
      1) 서비스 이용 제한이용자는 다음 각호에 해당하는 행위를 하여서는 아니 되며
      해당 행위를 한 경우에 사이트는 이용자의 서비스 이용 제한 및 적법한 조치를
      할 수 있습니다. <br />
      2) 타인의 사이트 이용을 방해하거나 정보를 도용하는 행위 <br />
      3) 사이트의 운영진, 직원 또는 관계자를 사칭하는 행위 <br />
      4) 사이트, 기타 제3자의 인격권 또는 지적재산권을 침해하거나 업무를
      방해하는 행위 <br />
      5) 범죄와 결부된다고 객관적으로 판단되는 행위 <br />
      6) 기타 관련 법령에 위배되는 행위 <br />
      <span className={cx("title")}>제 9조 손해배상</span>
      1) 본 사이트의 발생한 모든 민, 형법상 책임은 회원 본인에게 1차적으로
      있습니다. <br />
      2) 본 사이트로부터 이용자가 받은 손해가 천재지변 등 불가항력적이거나
      이용자의 고의 또는 과실로 인하여 발생한 때에는 손해배상을 하지 않습니다.{" "}
      <br />
      <span className={cx("title")}>제 10조 면책</span>
      1) 운영자는 이용자가 사이트의 서비스 제공으로 부터 기대되는 이익을 얻지
      못하였거나 서비스 자료에 대한 취사선택 또는 이용으로 발생하는 손해 등에
      대해서는 책임이 면제됩니다. <br />
      2) 운영자는 본 사이트의 서비스 기반 및 타 통신 업자가 제공하는 전기통신
      서비스의 장애로 인한 경우에는 책임이 면제되며 본 사이트의 서비스 기반과
      관련되어 발생한 손해에 대해서는 사이트의 이용약관에 준합니다 <br />
      3) 운영자는 이용자가 전송한 자료와 관련하여 일체의 책임을 지지 않습니다.{" "}
      <br />
      4) 운영자는 이용자의 귀책 사유로 인하여 서비스 이용의 장애가 발생한
      경우에는 책임지지 아니합니다. <br />
      5) 운영자는 이용자 상호 간 또는 이용자와 제3자 상호 간, 기타 이용자 간의
      본 서비스 내외를 불문한 일체의 활동(데이터 전송, 기타 커뮤니티 활동
      포함)에 대하여 책임을 지지 않습니다. <br />
      6) 운영자는 이용자가 전송한 자료 및 본 사이트로 이용자가 제공받을 수 있는
      모든 자료들의 진위, 신뢰도, 정확성 등 그 내용에 대해서는 책임지지
      아니합니다. <br />
      7) 운영자는 운영자의 귀책 사유 없이 이용자간 또는 이용자와 제3자간에
      발생한 일체의 분쟁에 대하여 책임지지 아니합니다. <br />
      8) 운영자는 서버 등 설비의 관리, 점검, 보수, 교체 과정 또는 소프트웨어의
      운용 과정에서 고의 또는 고의에 준하는 중대한 과실 없이 발생할 수 있는
      시스템의 장애, 제3자의 공격으로 인한 시스템의 장애, 국내외의 저명한
      연구기관이나 보안 관련 업체에 의해 대응 방법이 개발되지 아니한 컴퓨터
      바이러스 등의 유포나 기타 운영자가 통제할 수 없는 불가항력적 사유로 인한
      회원의 손해에 대하여 책임지지 않습니다.
      <br />
      <br />이 약관은 사이트 개설일부터 시행합니다.
    </div>
  );

  const personalPolicy = (
    <div className={cx("terms_body")}>
      개인정보처리방침
      <br />
      • ‘방배사’ 애플리케이션(이하 ‘앱’)을 운영하는 주식회사 방배사(이하
      '회사')는 정보통신망 이용촉진 및 정보보호 등에 관한 법률(이하
      ‘정보통신망법’), 개인정보보호법 등 관련 법에 따라 이용자의 개인정보 보호
      및 권익을 보호하고 개인정보와 관련한 이용자의 고충을 원활하게 처리할 수
      있도록 다음과 같은 처리방침을 두고 있습니다. <br />
      • 회사는 개인정보처리방침을 개정하는 경우 홈페이지 및 앱을 통하여
      공지합니다. <br />
      • 본 방침은 2023년 06월 30일부터 시행됩니다. <br />
      <br />
      1. 개인정보 수집 목적 및 보유·이용기간
      <br />
      -목적 : 서비스 회원가입
      <br />
      -필수항목 : 휴대전화번호, 중복가입확인정보(DI), <br />
      -선택항목 : 이름, 생년월일, 이메일 주소, 신분증 사본(주민등록증,
      운전면허증, 외국인등록증 중 택 1), 성별, 여권번호, 운전면허번호
      <br />
      *보존기간 : 회원탈퇴 시<br />
      • 회사가 처리하는 회원정보의 목적과 항목이 변경될 경우에는 관련법령에 따라
      사전에 동의를 요청합니다.
      <br />
      • 회사는 주민등록번호 처리를 원칙적으로 금지하며 업무 수행 중 법률,
      대통령령, 국회규칙, 대법원규칙, 헌법재판소규칙, 중앙선거관리위원회 규칙 및
      감사원규칙에서 구체적으로 주민등록번호의 처리를 요구할 경우에만 처리하고
      있습니다.
      <br />
      • 회사는 다음의 방법으로 이용자의 개인정보를 수집합니다. <br />
      o 회사가 운영하는 웹사이트에서 이용자가 직접 입력하게 하는 방식
      <br />
      o 서비스를 이용하는 과정에 쿠키, 접속 로그 등 자동으로 생성 및 수집되는
      방식
      <br />
      • 수집한 개인정보는 관련법령에 따른 개인정보 보유·이용기간 또는
      정보주체로부터 개인정보 수집 시에 동의 받은 개인정보 보유·이용기간 내에서
      개인정보를 보유·이용합니다.
      <br />
      • 이용자에게 동의 받은 개인정보의 수집목적이 달성되더라도 관련법령에 따라
      의무 보관해야 하는 개인정보 보유이용기간은 다음과 같습니다. <br />
      <br />
      (1) 거래내역 및 증빙서류와 관련된 정보
      <br />
      보유 기간 : 5년 <br />
      보유 근거 : 국세기본법, 법인세법
      <br />
      (2) 광고에 관한 기록
      <br />
      보유 기간 : 6개월
      <br />
      보유 근거 : 전자상거래 등에서의 소비자보호에 관한 법률
      <br />
      (3) 계약 또는 청약철회 등에 관한 기록
      <br />
      보유 기간 : 5년
      <br />
      보유 근거 : 전자상거래 등에서의 소비자보호에 관한 법률
      <br />
      (4) 대금결제 및 재화 등의 공급에 관한 기록
      <br />
      보유 기간 : 5년
      <br />
      보유 근거 : 전자상거래 등에서의 소비자보호에 관한 법률
      <br />
      (5) 소비자의 불만 또는 분쟁처리에 관한 기록
      <br />
      보유 기간 : 3년
      <br />
      보유 근거 : 전자상거래 등에서의 소비자보호에 관한 법률
      <br />
      (6) 접속에 관한 기록보존
      <br />
      보유 기간 : 3개월
      <br />
      보유 근거 : 통신비밀보호법
      <br />
      (7) 상법 등 관련법령에 따라 보존할 필요성이 있는 경우
      <br />
      보유 기간 : 10년
      <br />
      보유 근거 : 상법
      <br />
      <br />
      2. 개인정보의 처리 위탁 <br />
      • 회사는 원활한 개인정보 업무처리를 위하여 다음과 같이 개인정보 처리업무를
      위탁하고 있습니다.
      <br />
      수탁자 : 한국모바일인증(주)
      <br />
      위탁업무 : 휴대폰 본인인증서비스
      <br />
      보유기간 : 별도로 저장하지 않음
      <br />
      (본인인증 서비스 업체 보유 정보)
      <br />
      • 회사는 위탁 계약 체결 시 관련법령에 따라 수탁자가 개인정보를 안전하게
      처리하는지를 감독하고 있습니다.
      <br />
      • 위탁 업무의 내용이나 수탁자가 추가, 변경될 경우에는 지체 없이 관련
      법령에 따른 사전 동의 안내 또는 본 개인정보 처리방침을 통하여 공개하도록
      하겠습니다.
      <br />
      <br />
      3. 개인정보의 제3자 제공에 관한 사항
      <br />
      • 회사는 정보주체의 개인정보를 ‘1. 개인정보 수집 목적 및
      보유·이용기간’에서 명시한 범위 내에서만 처리하며, 정보주체의 동의, 법률의
      특별한 규정 등 개인정보보호법 제17조에 해당하는 경우에만 개인정보를
      제3자에게 제공합니다. <br />
      • 회사는 이용자의 개인정보를 사전동의 없이 제 3자에게 제공할 수 없습니다.
      다만 다음의 경우에는 예외로 합니다.
      <br />
      o 통계작성, 학술연구 또는 시장조사를 위하여 필요한 경우로서 특정 개인을
      식별할 수 없는 형태로 제공하는 경우
      <br />
      o 관계법령에 의하여 국가기관으로부터 요구 받은 경우
      <br />
      o 범죄에 대한 수사상의 목적이 있거나, 정보통신 윤리위원회의 요청이 있는
      경우
      <br />
      o 기타 관계법령에서 정한 절차에 따른 요청이 있는 경우
      <br />
      <br />
      4. 이용자의 권리와 의무 및 그 행사방법
      <br />
      • 이용자 및 법정대리인은 등록되어 있는 이용자의 개인정보와 관련하여,
      다음과 같은 권리를 행사할 수 있습니다.
      <br />o 홈페이지 내정보{" > "} 정보수정에서 이용자의 개인정보를 열람 및
      정정하실 수 있습니다. <br />o 홈페이지 내정보{" > "} 정보수정{" > "}{" "}
      회원탈퇴에서 이용자의 개인정보를 삭제하실 수 있습니다. <br />
      o 개인정보의 오류 등에 대한 정정 또는 삭제를 요청한 경우에는 정정 또는
      삭제를 완료하기 전까지 당해 개인정보를 이용하거나 제공하지 않습니다.
      <br />
      • 개인정보의 정정 및 삭제 요구는 다른 법령에서 그 개인정보가 수집 대상으로
      명시되어 있는 경우에는 그 삭제를 요구할 수 없습니다
      <br />
      • 이용자 권리 행사(열람, 정정, 처리정지, 삭제)는 이용자의 법정대리인이나
      위임을 받은 자 등 대리인을 통하여 하실 수 있습니다. 이 경우 개인정보보호법
      시행규칙 별지 제11호 서식에 따른 위임장을 제출해야 합니다.
      <br />
      • 개인정보주체 권리에 따른 열람의 요구, 정정·삭제의 요구, 처리 정지의 요구
      시 열람 등 요구를 한 자가 본인이거나 정당한 대리인인지를 확인합니다.
      <br />
      • 이용자는 개인정보주체로서 다음과 같은 의무를 가집니다.
      <br />
      o 이용자는 자신의 개인정보를 최신의 상태로 유지해야 하며, 부정확한 정보
      입력으로 발생하는 문제의 책임은 이용자 자신에게 있습니다.
      <br />
      o 이용자는 계정 등에 대해 보안을 유지할 책임이 있으며 제3자에게 이를
      양도하거나 대여할 수 없습니다.
      <br />
      o 타인의 개인정보를 도용하여 서비스 신청 시 이용자격 상실과 함께
      관계법령에 의거하여 처벌될 수 있습니다.
      <br />
      <br />
      5. 개인정보의 파기
      <br />
      • 회사는 원칙적으로 개인정보 처리목적이 달성된 경우에는 지체 없이 해당
      개인정보를 파기합니다. 파기의 절차 및 방법은 다음과 같습니다.
      <br />
      o 파기절차 <br />
      • 이용자가 입력한 정보는 목적 달성 후 즉시 파기합니다. 다만, 1년간
      서비스를 이용하지 않은 회원은 이를 사전에 고지하고, 이용자의 별도의 요청이
      없는 경우 고지하고 이용자의 별도의 요청이 없는 경우 복구할 수 없는
      방법으로 완전 삭제합니다.
      <br />
      o 파기방법 <br />
      • 전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을
      사용합니다.
      <br />
      • 종이에 출력된 개인정보는 파쇄기를 통하여 파기합니다.
      <br />
      <br />
      6. 개인정보 자동 수집 장치의 설치와 운영 및 거부에 관한 사항
      <br />
      • 서비스 이용과정이나 개인정보 처리과정에서 다음과 같은 정보들이 자동으로
      생성/수집되고 다음의 목적으로 이용될 수 있습니다. <br />
      • 자동생성정보 : 방문일시, 서비스 이용기록, 접속IP정보, 접속 로그,
      쿠키(쿠키는 웹사이트를 운영하는데 이용되는 서버(http)가 이용자의 컴퓨터
      브라우저에게 보내는 소량의 정보이며 이용자 PC 컴퓨터의 하드디스크에
      저장되기도 합니다.)
      <br />
      o 자동생성정보의 사용목적: <br />
      • 이용자 인증
      <br />
      • 이용자에게 최적화된 정보 제공 <br />
      • 개인 맞춤형 상품 광고 및 마케팅
      <br />
      • 이용자 행위 및 서비스 분석
      <br />
      • 정보통신망법 상 기록 의무 준수
      <br />
      o 쿠키의 설치운영 및 거부 방법 : 아래 방법을 통해 쿠키 저장을 거부할 수
      있습니다.
      <br />• Internet Explorer의 경우 : 웹 브라우저 상단의 도구{" > "}인터넷
      옵션
      {" > "}개인정보 메뉴의 옵션 설정
      <br />• Microsoft Edge의 경우 : 웹 브라우저 상단 메뉴{" > "} 설정{" > "}{" "}
      고급 설정 보기{" > "} 쿠키 메뉴의 옵션 설정
      <br />• Chrome의 경우 : 웹 브라우저 상단 메뉴{" > "} 설정{" > "} 고급
      {" > "} 콘텐츠 설정{" > "} 쿠키 메뉴의 옵션 설정
      <br />
      • 쿠키 저장을 거부할 경우, 서비스 이용에는 문제가 없으나 개인 맞춤형
      서비스 및 정보를 제공받으실 수 없습니다.
      <br />
      <br />
      7. 개인정보보호책임자 안내 <br />
      • 회사는 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와
      관련한 이용자의 불만처리 및 피해구제 등을 위하여 아래와 같이
      개인정보보호책임자를 지정하고 있습니다. <br />
      o 개인정보보호 책임자 <br />
      • 성명: 윤창기
      <br />
      • 직책: 대표이사
      <br />
      • 연락처: 1833-8603
      <br />
      • 이매일 주소 : bangbaesa@naver.com
      <br />
      • 이용자는 회사 서비스를 이용하면서 발생한 모든 개인정보보호 관련 문의,
      불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자로 문의하실 수
      있습니다. 회사는 이용자의 문의에 대해 지체 없이 답변 및 처리해드릴
      것입니다. <br />
      <br />
      8. 개인정보의 안전성 확보 조치
      <br />
      • 회사는 개인정보보호법 제29조에 따라 다음과 같이 안전성 확보에 필요한
      기술적, 관리적 및 물리적 조치를 하고 있습니다.
      <br />
      o 개인정보 취급 직원의 최소화 및 교육 <br />
      • 개인정보를 취급하는 직원을 최소화하고, 주기적인 개인정보 보호 교육을
      실시하여 개인정보를 관리하는 대책을 시행하고 있습니다.
      <br />
      o 내부관리계획의 수립 및 시행 <br />
      • 개인정보의 안전한 처리를 위하여 내부관리계획을 수립하고 시행하고
      있습니다.
      <br />
      o 접속기록의 보관 및 위변조 방지
      <br />
      • 개인정보 침해사고 발생 시 대응이 용이하도록 개인정보처리시스템에 접속한
      기록(웹 로그, 요약정보 등)을 최소 1년 이상 보관, 관리하고 있으며, 접속
      기록이 위?변조 및 도난, 분실되지 않도록 보안기능을 사용하고 있습니다.
      <br />
      o 개인정보의 암호화
      <br />
      • 이용자의 개인정보는 암호화 되어 저장 및 관리되고 있습니다. 또한 중요한
      데이터는 저장 및 전송 시 암호화하여 사용하는 등의 별도 보안기능을 사용하고
      있습니다.
      <br />
      o 해킹 등에 대비한 기술적 대책 <br />
      • 회사는 해킹이나 컴퓨터 바이러스 등에 의한 개인정보 유출 및 훼손을 막기
      위하여 보안프로그램을 설치하고 주기적인 갱신·점검을 하며, 외부로부터
      접근이 통제된 구역에 시스템을 설치하고 기술적/물리적으로 감시 및 차단하고
      있습니다.
      <br />
      o 개인정보에 대한 접근 제한 <br />
      • 개인정보를 처리하는 개인정보처리시스템에 대한 접근권한의 부여, 변경,
      말소를 통하여 개인정보에 대한 접근통제를 위한 조치를 하고 있습니다.
      <br />
      <br />
      9. 정보주체의 권익침해에 대한 구제방법
      <br />
      • 정보주체의 권익침해 관련 자세한 도움이 필요하시면 아래 기관에 문의하여
      주시기 바랍니다.
      <br />
      o 개인정보 침해신고센터 (한국인터넷진흥원 운영)
      <br />
      • 소관업무 : 개인정보 침해사실 신고, 상담 신청
      <br />
      • 홈페이지 : privacy.kisa.or.kr <br />
      • 전화 : (국번없이) 118 <br />
      • 주소 : (58324) 전남 나주시 진흥길 9(빛가람동 301-2) 3층
      개인정보침해신고센터
      <br />
      o 개인정보 분쟁조정위원회 <br />
      • 소관업무 : 개인정보 분쟁조정신청, 집단분쟁조정 (민사적 해결)
      <br />
      • 홈페이지 : www.kopico.go.kr <br />
      • 전화 : (국번없이) 1833-6972 <br />
      • 주소 : (03171) 서울특별시 종로구 세종대로 209 정부서울청사 4층
      <br />
      o 대검찰청 사이버범죄수사단 : 02-3480-3573 (www.spo.go.kr)
      <br />
      o 경찰청 사이버안전국 : 182 (cyberbureau.police.go.kr)
      <br />
      <br />
      10. 개인정보처리방침 변경에 관한 사항
      <br />
      • 이 개인정보처리방침은 시행일로부터 적용되며, 관련법령 및 방침에 따른
      변경 내용의 추가, 삭제 및 정정이 있는 경우에는 지체없이 홈페이지 통하여
      고지할 것입니다.
      <br />
    </div>
  );

  return (
    <div className={cx("container")} onClick={() => setVisible(false)}>
      <div onClick={(e) => e.stopPropagation()} className={cx("wrap")}>
        <div className={cx("top_title")}>
          {partName === "service" ? "서비스 이용약관" : "개인정보 처리방침"}
        </div>
        {partName === "service" ? servisePolicy : personalPolicy}
        <div className={cx("btn_wrap")}>
          <button className={cx("btn")} onClick={() => setVisible(false)}>
            확인
          </button>
        </div>
      </div>
    </div>
  );
}
