import { Dispatch, SetStateAction, useEffect } from "react";
import styles from "./PolicyModal.module.scss";
import className from "classnames/bind";

const cx = className.bind(styles);

type Props = {
  visible: boolean;
  partName: "service" | "personal";
  setVisible: Dispatch<SetStateAction<boolean>>;
};

export default function PolicyModal({ visible, partName, setVisible }: Props) {
  const servisePolicy = (
    <div className={cx("terms_body")}>
      <span className={cx("title")}>제 1조 목적</span>본 이용약관은
      &#34;방배사&#34;(이하 &#34;사이트&#34;)의 서비스의 이용조건과 운영에 관한
      제반 사항 규정을 목적으로 합니다.
      <span className={cx("title")}>제 2조 용어의 정의</span>
      본 약관에서 사용되는 주요한 용어의 정의는 다음과 같습니다. <br />
      1) 이용자 : 사이트에 방문하여 사이트를 이용하는 이용자를 말합니다. <br />
      2) 운영자 : 서비스에 홈페이지를 개설하여 운영하는 운영자를 말합니다.
      <span className={cx("title")}>제 3조 약관 외 준칙</span>
      운영자는 필요한 경우 별도로 운영정책을 공지 안내할 수 있으며, 본 약관과
      운영정책이 중첩될 경우 운영정책이 우선 적용됩니다. <br />
      <span className={cx("title")}>제 4조 서비스 이용 신청</span>
      1) 사이트를 이용하려는 이용자는 사이트에서 요청하는 제반 정보(회신 받으실
      이메일, 연락처, 문의내용을)을 제출할 수 있습니다. <br />
      2) 타인의 정보를 도용하거나 허위의 정보를 제출하는 등 본인의 진정한 정보를
      제출하지 않은 이용자는 사이트 이용과 관련하여 아무런 권리를 주장할 수
      없으며, 관계 법령에 따라 처벌받을 수 있습니다. <br />
      <span className={cx("title")}>제 5조 운영자의 의무</span>
      1) 운영자는 이용자로부터 제기되는 의견이나 불만이 정당하다고 인정할
      경우에는 가급적 빨리 처리하여야 합니다. 다만, 개인적인 사정으로 신속한
      처리가 곤란한 경우에는 사후에 공지 또는 이용회원에게 쪽지, 전자우편 등을
      보내는 등 최선을 다합니다. <br />
      2) 운영자는 계속적이고 안정적인 사이트 제공을 위하여 설비에 장애가
      생기거나 유실된 때에는 이를 지체 없이 수리 또는 복구할 수 있도록 사이트에
      요구할 수 있습니다. 다만, 천재지변 또는 사이트나 운영자에 부득이한 사유가
      있는 경우, 사이트 운영을 일시 정지할 수 있습니다. <br />
      <span className={cx("title")}>제 6조 이용자의 의무</span>
      1) 이용자는 본 약관에서 규정하는 사항과 운영자가 정한 제반 규정, 운영정책
      등 사이트가 공지하는 사항 및 관계 법령을 준수하여야 하며, 기타 사이트의
      업무에 방해가 되는 행위, 사이트의 명예를 손상하는 행위를 해서는 안 됩니다.{" "}
      <br />
      2) 이용자는 사이트의 명시적 동의가 없는 한 서비스의 이용 권한, 기타
      이용계약상 지위를 타인에게 양도, 증여할 수 없으며, 이를 담보로 제공할 수
      없습니다. <br />
      3) 이용자는 운영자와 사이트 및 제3자의 지적 재산권을 침해해서는 안 됩니다.{" "}
      <span className={cx("title")}>제 7조 서비스 이용 시간</span>
      1) 서비스 이용 시간은 업무상 또는 기술상 특별한 지장이 없는 한 연중무휴
      1일 24시간을 원칙으로 합니다. 단, 사이트는 시스템 정기점검, 증설 및 교체를
      위해 사이트가 정한 날이나 시간에 서비스를 일시 중단 할 수 있으며 예정된
      작업으로 인한 서비스 일시 중단은 사이트의 홈페이지에 사전에 공지하오니
      수시로 참고하시길 바랍니다. <br />
      2) 단, 사이트는 다음 경우에 대하여 사전 공지나 예고 없이 서비스를 일시적
      혹은 영구적으로 중단할 수 있습니다. - 긴급한 시스템 점검, 증설, 교체, 고장
      혹은 오동작을 일으키는 경우 - 국가비상사태, 정전, 천재지변 등의
      불가항력적인 사유가 있는 경우 - 전기통신사업법에 규정된 기간통신사업자가
      전기통신 서비스를 중지한 경우 - 서비스 이용의 폭주 등으로 정상적인 서비스
      이용에 지장이 있는 경우 <br />
      3) 전항에 의한 서비스 중단의 경우 사이트는 사전에 공지사항 등을 통하여
      회원에게 통지합니다. 단, 사이트가 통제할 수 없는 사유로 발생한 서비스의
      중단에 대하여 사전 공지가 불가능한 경우에는 사후 공지로 대신합니다.
      <span className={cx("title")}>제 8조 서비스 이용 제한</span>
      1) 서비스 이용 제한이용자는 다음 각호에 해당하는 행위를 하여서는 아니 되며
      해당 행위를 한 경우에 사이트는 이용자의 서비스 이용 제한 및 적법한 조치를
      할 수 있습니다. <br />
      2) 타인의 사이트 이용을 방해하거나 정보를 도용하는 행위 <br />
      3) 사이트의 운영진, 직원 또는 관계자를 사칭하는 행위 <br />
      4) 사이트, 기타 제3자의 인격권 또는 지적재산권을 침해하거나 업무를
      방해하는 행위 <br />
      5) 범죄와 결부된다고 객관적으로 판단되는 행위 <br />
      6) 기타 관련 법령에 위배되는 행위 <br />
      <span className={cx("title")}>제 9조 손해배상</span>
      1) 본 사이트의 발생한 모든 민, 형법상 책임은 회원 본인에게 1차적으로
      있습니다. <br />
      2) 본 사이트로부터 이용자가 받은 손해가 천재지변 등 불가항력적이거나
      이용자의 고의 또는 과실로 인하여 발생한 때에는 손해배상을 하지 않습니다.{" "}
      <br />
      <span className={cx("title")}>제 10조 면책</span>
      1) 운영자는 이용자가 사이트의 서비스 제공으로 부터 기대되는 이익을 얻지
      못하였거나 서비스 자료에 대한 취사선택 또는 이용으로 발생하는 손해 등에
      대해서는 책임이 면제됩니다. <br />
      2) 운영자는 본 사이트의 서비스 기반 및 타 통신 업자가 제공하는 전기통신
      서비스의 장애로 인한 경우에는 책임이 면제되며 본 사이트의 서비스 기반과
      관련되어 발생한 손해에 대해서는 사이트의 이용약관에 준합니다 <br />
      3) 운영자는 이용자가 전송한 자료와 관련하여 일체의 책임을 지지 않습니다.{" "}
      <br />
      4) 운영자는 이용자의 귀책 사유로 인하여 서비스 이용의 장애가 발생한
      경우에는 책임지지 아니합니다. <br />
      5) 운영자는 이용자 상호 간 또는 이용자와 제3자 상호 간, 기타 이용자 간의
      본 서비스 내외를 불문한 일체의 활동(데이터 전송, 기타 커뮤니티 활동
      포함)에 대하여 책임을 지지 않습니다. <br />
      6) 운영자는 이용자가 전송한 자료 및 본 사이트로 이용자가 제공받을 수 있는
      모든 자료들의 진위, 신뢰도, 정확성 등 그 내용에 대해서는 책임지지
      아니합니다. <br />
      7) 운영자는 운영자의 귀책 사유 없이 이용자간 또는 이용자와 제3자간에
      발생한 일체의 분쟁에 대하여 책임지지 아니합니다. <br />
      8) 운영자는 서버 등 설비의 관리, 점검, 보수, 교체 과정 또는 소프트웨어의
      운용 과정에서 고의 또는 고의에 준하는 중대한 과실 없이 발생할 수 있는
      시스템의 장애, 제3자의 공격으로 인한 시스템의 장애, 국내외의 저명한
      연구기관이나 보안 관련 업체에 의해 대응 방법이 개발되지 아니한 컴퓨터
      바이러스 등의 유포나 기타 운영자가 통제할 수 없는 불가항력적 사유로 인한
      회원의 손해에 대하여 책임지지 않습니다.
      <br />
      <br />이 약관은 사이트 개설일부터 시행합니다.
    </div>
  );

  const personalPolicy = (
    <div className={cx("terms_body")}>약관 대기중입니다.</div>
  );

  return (
    <div className={cx("container")} onClick={() => setVisible(false)}>
      <div onClick={(e) => e.stopPropagation()} className={cx("wrap")}>
        <div className={cx("top_title")}>
          {partName === "service" ? "서비스 이용약관" : "개인정보 처리방침"}
        </div>
        {partName === "service" ? servisePolicy : personalPolicy}
        <div className={cx("btn_wrap")}>
          <button className={cx("btn")} onClick={() => setVisible(false)}>
            확인
          </button>
        </div>
      </div>
    </div>
  );
}
